week7/day2/news_reader/skeleton/app/controllers/api/feeds_controller.rb

  def index
    render json: Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
    render json: Feed.find(params[:id]), include: :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 16 Sep 2014 23:08:49 UTC +00:00], ["title", "The Transfiguration"], ["updated_at", Tue, 16 Sep 2014 23:08:49 UTC +00:00], ["url", "http://somnule.wordpress.com/feed/"]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'something' LIMIT 1

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 2]]